{
  "editorState": {
    "root": {
      "children": [
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "These big teahouses are gone now. A few decades ago, there was at least one in every city. Tea was sold here, as well as simple snacks and food. People who played with birds would come here every day to rest their legs, drink tea and make the birds sing after they had had enough of playing with paintbrush and yellow birds. They also came here to discuss matters and to play matchmaker.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "In those years, there are often fights, but there are always friends to mediate between the two sides; thirty to fifty mouths of fighters, by the mediator, they will drink a bowl of tea, eat a bowl of rotten meat noodles (big teahouse special food, cheap, made up of fast when), you can turn the war into peace. In short, this is a very important place of the day, something or nothing can come to sit for half a day.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "Here one could hear the most absurd news, such as how a big spider somewhere had become a spirit and was struck by lightning. Strange opinions can also be heard here, such as building a big wall all along the seashore, which is enough to prevent foreign soldiers from coming ashore. You can also hear about the new accent created by a Peking opera singer and the best way to fry opium smoke.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "It was also a place to see someone's newest curiosity - an unearthed jade fan pendant, or a three-colored snuff bottle. This is such an important place that it could be considered a place of cultural exchange.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "[We are about to see such a teahouse now. [In the front door is the counter and the stove - in order to save some trouble, our stage can not stove; some pots and spoons in the back of the sound will be enough.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "The room is very tall, with long and square tables, long and small benches, all of which are teahouses. In the backyard, visible through the window, there was a high pergola, under which there were also teahouses. Inside the house and under the pergola there are places to hang bird cages. A note saying \"Don't talk about national affairs\" was posted everywhere.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "Two tea drinkers, whose names are unknown, are squinting, shaking their heads, and singing in a low voice. Two or three tea-goers, whose names are also unknown, are admiring the crickets in the tiles. Two men in gray overshirts-Song Enzi and Wu Xiangzi-are talking in low voices, and it looks as if they are the case officers (detectives) of the North Yamen.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "[There is another group fight today, said to be over a domestic pigeon, causing a dispute that must be settled by force. If a real fight breaks out, it will take a life, because the fighters who are being asked to fight include the brothers of the Good Fight Battalion and the treasury soldiers, all of whom are very powerful.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "Luckily, they couldn't really fight, because before the two sides could get the fighters together, someone had already interceded - and now the two sides were meeting here. Three by three, the fighters, all cross-eyed, short dress, at any time to come in, to the backyard.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        },
        {
          "children": [
            {
              "detail": 0,
              "format": 0,
              "mode": "normal",
              "style": "",
              "text": "[Master Ma Wu is in an unobtrusive corner, sitting alone, drinking tea. [Wang Lifa sits high up in the counter.",
              "type": "text",
              "version": 1
            }
          ],
          "direction": "ltr",
          "format": "",
          "indent": 0,
          "type": "paragraph",
          "version": 1
        }
      ],
      "direction": "ltr",
      "format": "",
      "indent": 0,
      "type": "root",
      "version": 1
    }
  },
  "lastSaved": 1691673956427,
  "source": "Playground",
  "version": "0.11.3"
}
